porous3D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// With L = U0 = 1 we have: Pe = U0*L/D0 = 1/D0, Da = k0*L/U0 = k0

K0  K0 [0  2  0 0 0 0 0 ] 1.0e-0;      // Dimensioned perm
D0  D0 [0  2 -1 0 0 0 0 ] 1.0e-2;      // Dimensioned diff
k0  k0 [0  0 -1 0 0 0 0 ] 1.0e+1;      // Dimensioned rate
 
// ************************************************************************* //
